src/InformationRegisters/ОценкаПроизводительностиКлючевыеОперации/ОценкаПроизводительностиКлючевыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаПроизводительностиКлючевыеОперации</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальноДопустимыйУровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремяВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВыполненаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомеченаНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОценкаПроизводительностиКлючевыеОперации/Forms/ФормаВыбора/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИнформационнаяБаза = Параметры.ИнформационнаяБаза;
	СписокЗапрещенныхОпераций = Параметры.СписокЗапрещенныхОпераций;
	МассивИдентификаторов = Новый Массив;
	Для Каждого Идентификатор Из СписокЗапрещенныхОпераций Цикл
		МассивИдентификаторов.Добавить(Идентификатор.Значение);
	КонецЦикла;
	
	СписокКлючевыхОпераций.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", ИнформационнаяБаза);
	СписокКлючевыхОпераций.Параметры.УстановитьЗначениеПараметра(
		"ЗапрещенныеУникальныеИдентификаторы", МассивИдентификаторов
	);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СписокКлючевыхОпераций

&НаКлиенте
Процедура СписокКлючевыхОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РезультатВыбора = Неопределено;
	
	НастройкиБратьИзБазы = Параметры.НастройкиБратьИзБазы;
	ТД = Элементы.СписокКлючевыхОпераций.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		РезультатВыбора = Новый Структура("УникальныйИдентификатор, Имя, Приоритет, ЦелевоеВремя");
		РезультатВыбора.УникальныйИдентификатор = ТД.УникальныйИдентификатор;
		РезультатВыбора.Имя = ТД.Имя;
		
		РезультатВыбора.Приоритет = ТД["Приоритет" + ?(НастройкиБратьИзБазы, "ВИБ", "")];
		РезультатВыбора.ЦелевоеВремя = ТД["ЦелевоеВремя" + ?(НастройкиБратьИзБазы, "ВИБ", "")];
		
	КонецЕсли;
	
	ЭтотОбъект.Закрыть(РезультатВыбора);
	
КонецПроцедуры
